RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_ipa.h
/* IPA_FMADDR */
#define IPA_FMADDR_FMADDR                 BITS(0,31)                    /*!< foreground memory base address */

/* IPA_FLOFF */
#define IPA_FLOFF_FLOFF                   BITS(0,13)                    /*!< foreground line offset */

/* IPA_BMADDR */
#define IPA_BMADDR_BMADDR                 BITS(0,31)                    /*!< background memory base address */

/* IPA_BLOFF */
#define IPA_BLOFF_BLOFF                   BITS(0,13)                    /*!< background line offset */

/* IPA_FPCTL */
#define IPA_FPCTL_FPF                     BITS(0,3)                     /*!< foreground pixel format */
#define IPA_FPCTL_FLPF                    BIT(4)                        /*!< foreground LUT pixel format */
#define IPA_FPCTL_FLLEN                   BIT(5)                        /*!< foreground LUT loading enable */
#define IPA_FPCTL_FCNP                    BITS(8,15)                    /*!< foreground LUT number of pixel */
#define IPA_FPCTL_FAVCA                   BITS(16,17)                   /*!< foreground alpha value calculation algorithm */
#define IPA_FPCTL_FIIMEN                  BIT(23)                       /*!< foreground input interlace mode enable */
#define IPA_FPCTL_FPDAV                   BITS(24,31)                   /*!< foreground pre-defined alpha value */

/* IPA_FPV */
#define IPA_FPV_FPDBV                     BITS(0,7)                     /*!< foreground pre-defined red value */
#define IPA_FPV_FPDGV                     BITS(8,15)                    /*!< foreground pre-defined green value */
#define IPA_FPV_FPDRV                     BITS(16,23)                   /*!< foreground pre-defined red value */

/* IPA_BPCTL */
#define IPA_BPCTL_BPF                     BITS(0,3)                     /*!< background pixel format */
#define IPA_BPCTL_BLPF                    BIT(4)                        /*!< background LUT pixel format */
#define IPA_BPCTL_BLLEN                   BIT(5)                        /*!< background LUT loading enable */
#define IPA_BPCTL_BCNP                    BITS(8,15)                    /*!< background LUT number of pixel */
#define IPA_BPCTL_BAVCA                   BITS(16,17)                   /*!< background alpha value calculation algorithm */
#define IPA_BPCTL_BPDAV                   BITS(24,31)                   /*!< background pre-defined alpha value */

/* IPA_BPV */
#define IPA_BPV_BPDBV                     BITS(0,7)                     /*!< background pre-defined blue value */
#define IPA_BPV_BPDGV                     BITS(8,15)                    /*!< background pre-defined green value */
#define IPA_BPV_BPDRV                     BITS(16,23)                   /*!< background pre-defined red value */

/* IPA_FLMADDR */
#define IPA_FLMADDR_FLMADDR               BITS(0,31)                    /*!< foreground LUT memory base address */

/* IPA_BLMADDR */
#define IPA_BLMADDR_BLMADDR               BITS(0,31)                    /*!< background LUT memory base address */

/* IPA_DPCTL */
#define IPA_DPCTL_DPF                     BITS(0,2)                     /*!< destination pixel control register */
#define IPA_DPCTL_ROT                     BITS(8,9)                     /*!< destination image rotation angle */
#define IPA_DPCTL_HORDEC                  BITS(16,17)                   /*!< destination horizontal pre decimation filter control */
#define IPA_DPCTL_VERDEC                  BITS(18,19)                   /*!< destination verticle pre decimation filter control */

/* IPA_DPV */
/* destination pixel format ARGB8888 */
#define IPA_DPV_DPDBV_0                   BITS(0,7)                     /*!< destination pre-defined blue value */
#define IPA_DPV_DPDGV_0                   BITS(8,15)                    /*!< destination pre-defined green value */
#define IPA_DPV_DPDRV_0                   BITS(16,23)                   /*!< destination pre-defined red value */
#define IPA_DPV_DPDAV_0                   BITS(24,31)                   /*!< destination pre-defined alpha value */

/* destination pixel format RGB888 */
#define IPA_DPV_DPDBV_1                   BITS(0,7)                     /*!< destination pre-defined blue value */
#define IPA_DPV_DPDGV_1                   BITS(8,15)                    /*!< destination pre-defined green value */
#define IPA_DPV_DPDRV_1                   BITS(16,23)                   /*!< destination pre-defined red value */

/* destination pixel format RGB565 */
#define IPA_DPV_DPDBV_2                   BITS(0,4)                     /*!< destination pre-defined blue value */
#define IPA_DPV_DPDGV_2                   BITS(5,10)                    /*!< destination pre-defined green value */
#define IPA_DPV_DPDRV_2                   BITS(11,15)                   /*!< destination pre-defined red value */

/* destination pixel format ARGB1555 */
#define IPA_DPV_DPDBV_3                   BITS(0,4)                     /*!< destination pre-defined blue value */
#define IPA_DPV_DPDGV_3                   BITS(5,9)                     /*!< destination pre-defined green value */
#define IPA_DPV_DPDRV_3                   BITS(10,14)                   /*!< destination pre-defined red value */
#define IPA_DPV_DPDAV_3                   BIT(15)                       /*!< destination pre-defined alpha value */

/* destination pixel format ARGB4444 */
#define IPA_DPV_DPDBV_4                   BITS(0,3)                     /*!< destination pre-defined blue value */
#define IPA_DPV_DPDGV_4                   BITS(4,7)                     /*!< destination pre-defined green value */
#define IPA_DPV_DPDRV_4                   BITS(8,11)                    /*!< destination pre-defined red value */
#define IPA_DPV_DPDAV_4                   BITS(12,15)                   /*!< destination pre-defined alpha value */

/* IPA_DMADDR */
#define IPA_DMADDR_DMADDR                 BITS(0,31)                    /*!< destination memory base address */

/* IPA_DLOFF */
#define IPA_DLOFF_DLOFF                   BITS(0,13)                    /*!< destination line offset */

